{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"user_input","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"user_input"},"inbound_nodes":[]},{"name":"item_input","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"item_input"},"inbound_nodes":[]},{"name":"user_embedding","class_name":"Embedding","config":{"input_dim":60,"output_dim":64,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"user_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["user_input",0,0,{}]]]},{"name":"item_embedding","class_name":"Embedding","config":{"input_dim":76,"output_dim":64,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"item_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["item_input",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["user_embedding",0,0,{}]]]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["item_embedding",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}],["flatten_Flatten2",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"user_bias_embedding","class_name":"Embedding","config":{"input_dim":60,"output_dim":1,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"user_bias_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["user_input",0,0,{}]]]},{"name":"item_bias_embedding","class_name":"Embedding","config":{"input_dim":76,"output_dim":1,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"item_bias_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["item_input",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dot_Dot1","class_name":"Dot","config":{"axes":1,"normalize":false,"name":"dot_Dot1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}],["flatten_Flatten2",0,0,{}]]]},{"name":"flatten_Flatten3","class_name":"Flatten","config":{"name":"flatten_Flatten3","trainable":true},"inbound_nodes":[[["user_bias_embedding",0,0,{}]]]},{"name":"flatten_Flatten4","class_name":"Flatten","config":{"name":"flatten_Flatten4","trainable":true},"inbound_nodes":[[["item_bias_embedding",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["dot_Dot1",0,0,{}],["flatten_Flatten3",0,0,{}],["flatten_Flatten4",0,0,{}],["dense_Dense2",0,0,{}]]]},{"name":"activation_Activation1","class_name":"Activation","config":{"activation":"sigmoid","name":"activation_Activation1","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]}],"input_layers":[["user_input",0,0],["item_input",0,0]],"output_layers":[["activation_Activation1",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightSpecs":[{"name":"user_embedding/embeddings","shape":[60,64],"dtype":"float32"},{"name":"item_embedding/embeddings","shape":[76,64],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[128,32],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[32],"dtype":"float32"},{"name":"user_bias_embedding/embeddings","shape":[60,1],"dtype":"float32"},{"name":"item_bias_embedding/embeddings","shape":[76,1],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[1],"dtype":"float32"}]}