{
    "modelTopology": {
        "class_name": "Model",
        "config": {
            "name": "model1",
            "layers": [
                {
                    "name": "user_input",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            1
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "user_input"
                    },
                    "inbound_nodes": []
                },
                {
                    "name": "item_input",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            1
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "item_input"
                    },
                    "inbound_nodes": []
                },
                {
                    "name": "user_embedding",
                    "class_name": "Embedding",
                    "config": {
                        "input_dim": 51,
                        "output_dim": 50,
                        "embeddings_initializer": {
                            "class_name": "RandomUniform",
                            "config": {
                                "minval": -0.05,
                                "maxval": 0.05,
                                "seed": null
                            }
                        },
                        "embeddings_regularizer": null,
                        "activity_regularizer": null,
                        "embeddings_constraint": null,
                        "mask_zero": null,
                        "input_length": null,
                        "name": "user_embedding",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            null
                        ]
                    },
                    "inbound_nodes": [
                        [
                            [
                                "user_input",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "item_embedding",
                    "class_name": "Embedding",
                    "config": {
                        "input_dim": 77,
                        "output_dim": 50,
                        "embeddings_initializer": {
                            "class_name": "RandomUniform",
                            "config": {
                                "minval": -0.05,
                                "maxval": 0.05,
                                "seed": null
                            }
                        },
                        "embeddings_regularizer": null,
                        "activity_regularizer": null,
                        "embeddings_constraint": null,
                        "mask_zero": null,
                        "input_length": null,
                        "name": "item_embedding",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            null
                        ]
                    },
                    "inbound_nodes": [
                        [
                            [
                                "item_input",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "flatten_Flatten1",
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_Flatten1",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "user_embedding",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "flatten_Flatten2",
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_Flatten2",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "item_embedding",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "dot_Dot1",
                    "class_name": "Dot",
                    "config": {
                        "axes": 1,
                        "normalize": false,
                        "name": "dot_Dot1",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "flatten_Flatten1",
                                0,
                                0,
                                {}
                            ],
                            [
                                "flatten_Flatten2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "output",
                    "class_name": "Dense",
                    "config": {
                        "units": 1,
                        "activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "output",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "dot_Dot1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "user_input",
                    0,
                    0
                ],
                [
                    "item_input",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "output",
                    0,
                    0
                ]
            ]
        },
        "keras_version": "tfjs-layers 4.22.0",
        "backend": "tensor_flow.js"
    },
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v4.22.0",
    "convertedBy": null,
    "weightSpecs": [
        {
            "name": "user_embedding/embeddings",
            "shape": [
                51,
                50
            ],
            "dtype": "float32"
        },
        {
            "name": "item_embedding/embeddings",
            "shape": [
                77,
                50
            ],
            "dtype": "float32"
        },
        {
            "name": "output/kernel",
            "shape": [
                1,
                1
            ],
            "dtype": "float32"
        },
        {
            "name": "output/bias",
            "shape": [
                1
            ],
            "dtype": "float32"
        }
    ]
}